Revit 2024 API
PlanViewRange Members
The PlanViewRange type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PlanViewRange
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLevelId
 Get the element id of the level for a View Depth plane
GetOffset
 Get the offset value associated with a View Depth plane
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLevelId
 Set the level for a View Depth plane
SetOffset
 Set the offset value associated with a View Depth plane
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Current
 View range for the current plane
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LevelAbove
 View range for the level above the specified plane
LevelBelow
 View range for the level below the specified plane
Unlimited
 View range is unlimited
See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace